code-examples/racun-s-elektronickim-potpisom-934-odgovor.xml

<?xml version="1.0" encoding="UTF-8"?>  
<soap:Envelope  xmlns:soap ="http://schemas.xmlsoap.org/soap/envelope/ " 
xmlns:xsd ="http://www.w3.org/2001/XMLSchema "  
xmlns:xsi ="http://www.w3.org/2001/XMLSchema-instance "> 
<soap:Body> 
<tns:ProvjeraOdgovor  Id="G0xcabf5080-4D "  
xsi:schemaLocation ="http://www.apis-it.hr/fin/2012/types/f73 ../schema/FiskalizacijaSchema.xsd " 
xmlns:tns ="http://www.apis-it.hr/fin/2012/types/f73 "> 
<tns:Zaglavlje> 
<tns:IdPoruke>733362f1-063f-11e2-892e-0800200c9a66 </tns:IdPoruke> 
<tns:DatumVrijeme>04.07.2016T21:10:38 </tns:DatumVrijeme> 
</tns:Zaglavlje> 
<tns:Racun> 
<tns:Oib>98765432198 </tns:Oib> 
<tns:USustPdv>true</tns:USustPdv> 
<tns:DatVrijeme>04.07.2016T12:00:14 </tns:DatVrijeme>  
<tns:OznSlijed>P</tns:OznSlijed> 
<tns:BrRac> 
<tns:BrOznRac>12</tns:BrOznRac> 
<tns:OznPosPr>POSL1</tns:OznPosPr> 
<tns:OznNapUr>12</tns:OznNapUr> 
</tns:BrRac> 
<tns:Pdv> 
<tns:Porez> 
<tns:Stopa>25.00</tns:Stopa> 
<tns:Osnovica>10.00</tns:Osnovica> 
<tns:Iznos>2.50</tns:Iznos> 
</tns:Porez> 
</tns:Pdv> 
<tns:Pnp> 
<tns:Porez> 
<tns:Stopa>3.00</tns:Stopa> 
<tns:Osnovica>10.00</tns:Osnovica> 
<tns:Iznos>0.30</tns:Iznos> 
</tns:Porez> 
</tns:Pnp> 
<tns:IznosOslobPdv>12.00</tns:IznosOslobPdv> 
<tns:Naknade> 
<tns:Naknada> 
<tns:NazivN>Povratna naknada </tns:NazivN> 
<tns:IznosN>1.00</tns:IznosN> 
</tns:Naknada> 
</tns:Naknade> 
<tns:IznosUkupno>25.80</tns:IznosUkupno> 
<tns:NacinPlac>K</tns:NacinPlac> 
<tns:OibOper>01234567890 </tns:OibOper> 
<tns:ZastKod>e4d909c290d0fb1ca068ffaddf22cbd0 </tns:ZastKod> 
<tns:NakDost>false</tns:NakDost> 
<tns:ParagonBrRac>123/458/5 </tns:ParagonBrRac> 
</tns:Racun> 
<tns:Greske> 
<tns:Greska> 
<tns:SifraGreske>v100</tns:SifraGreske> 
<tns:PorukaGreske>Poruka je ispravna. </tns:PorukaGreske> 
</tns:Greska> 
</tns:Greske> 
<Signature  xmlns="http://www.w3.org/2000/09/xmldsig# "> 
<SignedInfo> 
<CanonicalizationMethod  Algorithm ="http://www.w3.org/TR/2001/REC-xml-c14n-
20010315 "/> 
<SignatureMethod  Algorithm ="http://www.w3.org/2000/09/xmldsig#rsa-sha1 "/> 
<Reference  URI="#G0xcabf5080-4D "> 
<Transforms> 
<Transform  Algorithm ="http://www.w3.org/2000/09/xmldsig#enveloped-
signature "/> 
<Transform  Algorithm ="http://www.w3.org/TR/2001/REC-xml-c14n-20010315 "/> 
</Transforms> 
<DigestMethod  Algorithm ="http://www.w3.org/2000/09/xmldsig#sha1 "/> 
<DigestValue>4j9JKFMvg6Mmfx7ERu8R3WkZTtQ= </DigestValue> 
</Reference> 
</SignedInfo> 
<SignatureValue>P5bIa6dPJjdlvov/pmmJvML7nMep7Xea4+LiWHEJEfsOz3SSKG4wwuVdGM+7k+CGt799
No4r1KKulaRRPMQW/vh0qtAm/0V/o45cIpgYB1YFUZdCsNktasYh4gkD/RQiF8ph/86W8zmY4fdLrqb45P176
e/DVcWJkduHeF2t4afUyJANti8czeimMB1uIaHvZwSMlvDKCN93tXoSlwGX3CXDg8kTRzpDC1x3r1aboaRrLp
kgzSZFrnMe4aBCqFnOpZjcXZa321hK3shl0PSij52IN1KWuMP9ekldj+XVNGQa/Ecj8RjuFDKwgoyhxpB9WZ/j
Ga81QAQ0DQsckMkF6g== </SignatureValue> 
<KeyInfo> 
<X509Data> 
<X509Certificate>MIIExDCCA6ygAwIBAgIEPssQcTANBgkqhkiG9w0BAQUFADArMQswCQYDVQQGEwJIUjE
NMAsGA1UEChMERklOQTENMAsGA1UECxMEREVNTzAeFw0xMjA5MjYwODExNDlaFw0xNDA5MjYwODQxND
laMHgxCzAJBgNVBAYTAkhSMQ0wCwYDVQQKEwRGSU5BMQ0wCwYDVQQLEwRERU1PMREwDwYDVQQLEw
hQb3Nsb3ZuaTEgMB4GA1UECxMXQVBJUyBJVCBELk8uTy4gODA1NDEzNzIxFjAUBgNVBAMTDWZpc2thbG
Npc3Rlc3QwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQC81TtKtJ84emCS/HK7gSovjNdluZWB
0DbIMq3cBFpOpmurcbDCJ1Z17XiPLa+UWYIqyAjHQyDnG/H4c5EeGoli9swz5QcZFBmyXTpSd3GuMROgUA
d4bcvbw1/HDONE5cE8PL11GIy8gi5ANZkujalYmx+1ImnhHxx1Bh2UJ/bcl2eXPtieBQBwtClATSzseB5FFz8Lc
SyfzM7h39PsAIZ0p8YzH7W+307gvgrJHYb/n4ADwlxieHqb5j74DVD0rUPcUE5d0nSZ7hfEkW8xICgs1Ly6Vu
3w7Z5M8vb4QmoPnlT1EaHCXiweuK6vjkUk8RQmYY4lTFBs8zHiG7h4n9bPAgMBAAGjggGhMIIBnTAOBgNV
HQ8BAf8EBAMCBaAwQgYDVR0gBDswOTA3BgkrfIhQBR8FBAIwKjAoBggrBgEFBQcCARYcaHR0cDovL2RlbW
8tcGtpLmZpbmEuaHIvY3BzLzCBzgYDVR0fBIHGMIHDMEKgQKA+pDwwOjELMAkGA1UEBhMCSFIxDTALBg
NVBAoTBEZJTkExDTALBgNVBAsTBERFTU8xDTALBgNVBAMTBENSTDcwfaB7oHmGT2xkYXA6Ly9kZW1vLW
xkYXAuZmluYS5oci9vdT1ERU1PLG89RklOQSxjPUhSP2NlcnRpZmljYXRlUmV2b2NhdGlvbkxpc3QlM0JiaW5h
cnmGJmh0dHA6Ly9kZW1vLXBraS5maW5hLmhyL2NybC9kZW1vY2EuY3JsMCsGA1UdEAQkMCKADzIwMTI
wOTI2MDgxMTQ5WoEPMjAxNDA5MjYwODQxNDlaMB8GA1UdIwQYMBaAFHpgI45InTJrpOUt3bhZtJT8QmK
eMB0GA1UdDgQWBBRgIJsZevSn6kDuSzChmaa9Sqr6sjAJBgNVHRMEAjAAMA0GCSqGSIb3DQEBBQUAA4I
BAQCo5kJWaNjgS+UG7XQHsHersDFk4K5W/Y2Pbubary0j3IwJrveHbUR3HOb0KiVenF6+1FL3sCI/2tfH3wS
szWL8Gkit8jUudTo5vDyLqEUXYDHlFUBwseudsPkUxPiQ6HuuFd3PiUAWf00chXD38eTjfapNu6VeQt4EORSO
+rEXdhWihVb5HxFIVPTkqHmq1KINwtV9+thwE3hNMwacRa4gwTB1O+jadVlJQMq+kgwnLGLBcwr0W+x1y
e6MPSYEUxSNFGHPG/evP9DRLwJtR3ngvlCDusnO+A75Nn40VYcoIjw6EN1V+plK+HkLye0zzLsnHIWTSGfZ
2sQVG5xCURiI </X509Certificate> 
<X509IssuerSerial> 
<X509IssuerName>OU=DEMO, O=FINA, C=HR </X509IssuerName> 
<X509SerialNumber>1053495409 </X509SerialNumber> 
</X509IssuerSerial> 
</X509Data> 
</KeyInfo> 
</Signature> 
</tns:ProvjeraOdgovor> 
</soap:Body> 
</soap:Envelope>